Repository: NovickVitaliy/english.io
Catalog: client/modules/Learning/Resources/Features/PreferenceConfiguring/Components/ConfigurePreferenceForm.*.resx
Languages: uk

# Preference_Configure_Form_Header
source: Configure Preferences
uk: Налаштування вподобань

# Example_Sentences_Number
source: Number of Example Sentences
uk: Кількість прикладних речень

# Exameple_Sentence_Number_Tooltip
source: Set the number of example sentences per word.
uk: Вкажіть кількість прикладних речень для кожного слова.

source: Daily Word Practice Limit
uk: Щоденний ліміт слів для практики

# Daily_Word_Practice_Limit_Tooltip
source: Set the maximum number of words to practice daily.
uk: Вкажіть максимальну кількість слів для щоденної практики.

source: Daily Sessions Count
uk: Кількість щоденних сеансів

# Daily_Sessions_Count_Tooltip
source: Set the number of daily practice sessions.
uk: Вкажіть кількість щоденних сеансів практики.

source: Save
uk: Зберегти

# Sessions_Time_Prompt
source: Enter time for each session
uk: Введіть час для кожної сесії

source: Session
uk: Сесія

# User_Preferences_Configured
source: User preferences were successfully created. Navigating you to the learning home page.
uk: Вподобання користувача були успішно створені. Перевожу вас до домашньої сторінки навчання.
