Repository: NovickVitaliy/english.io
Catalog: client/Client/Resources/App.*.resx
Languages: uk

# Hello World
source: Hello World 123
uk: Привіт Світ 1234

# About_Header
source: About us
uk: Про Нас

# About_Text1
source: Or maybe I should have written "About me". Currently, there is only one developer, and it is me - Vitalii.
uk: А може, варто було написати «Про себе». Наразі є лише один розробник, і це я - Віталій.

# About_Text2
source: I am Vitalii. 19 y.o student from Ukraine. I am passionate about .NET development and software engineering in general. It has been 1 year and half since I started learning .NET and to be honest I`ve made huge progress since that time. This project is my next stepping stone.
uk: Мене звати Віталій. 19-річний студент з України. Я захоплююсь розробкою .NET та програмною інженерією в цілому. взагалі. Пройшло 1,5 роки з тих пір, як я почав вивчати .NET і, чесно кажучи, я зробив величезний прогрес за цей час. часу. Цей проект - моя наступна сходинка.

# Get_In_Touch_Header
source: Get in Touch
uk: Зв'яжіться з нами

# Get_In_Touch_Prompt
source: Have questions or suggestions? Feel free to reach out to us!
uk: Маєте запитання чи пропозиції? Не соромтеся звертатися до нас!

# GIT_Email_Label
source: Email
uk: Електронна Адреса

# GIT_Contact_Form
source: Contact Form
uk: Контактна форма

# CF_Name
source: Your name
uk: Ваше ім'я.

# CF_Email
source: Your email
uk: Ваша електронна адреса

# CF_Message
source: Your message
uk: Ваше повідомлення

# CF_Submit
source: Send Message
uk: Надіслати повідомлення

# FAQ_Header
source: Frequently Asked Questions
uk: Поширені запитання

# FAQ_Text1
source: Get insights into the story behind the platform and the developer's journey.
uk: Дізнайтеся про історію створення платформи та шлях розробника.

# FAQ_Question1
source: Who is the developer behind this project?
uk: Хто є розробником цього проекту?

# FAQ_Answer1
source: The platform is developed by one and only 19 y.o student from Ukraine willing to help other people and make their life easier.
uk: Платформа була розроблена ентузіастом ШІ та досвідченим інженером-програмістом, який захоплюється створенням інструментів, що роблять вивчення мов інтуїтивно зрозумілим та ефективним.

# FAQ_Answer2
source: The idea originated from personal struggles in learning English efficiently. Combining technology, AI, and modern design, this project aims to offer a personalized and engaging experience for learners.
uk: Ідея виникла з особистої боротьби за ефективне вивчення англійської мови. Поєднуючи технології, штучний інтелект і сучасний дизайн, цей проект має на меті запропонувати учням персоналізований і цікавий досвід.

# FAQ_Question2
source: What inspired the creation of this project?
uk: Що надихнуло на створення цього проекту?

# FAQ_Question3
source: How does AI improve the learning experience?
uk: Як ШІ покращує процес навчання?

# FAQ_Answer3
source: AI provides tailored exercises and examples to ensure effective progress.
uk: ШІ аналізує ваші навчальні звички, динамічно налаштовує рівні складності та пропонує індивідуальні вправи і приклади для забезпечення ефективного прогресу.

# FAQ_Question4
source: What are the future plans for the project?
uk: Які плани на майбутнє у проекту?

# FAQ_Answer4
source: Future plans include integrating voice recognition, advanced analytics, and expanding vocabulary exercises to cover more practical scenarios.
uk: У планах на майбутнє - інтеграція розпізнавання голосу, розширеної аналітики та розширення словникових вправ, щоб охопити більше практичних сценаріїв.

# Features_Title
source: Key Features of Our AI-Powered English Learning Platform
uk: Ключові особливості нашої платформи для вивчення англійської на основі штучного інтелекту

# Features_Description
source: Explore the powerful features designed to make your English learning journey structured, engaging, and effective.
uk: Досліджуйте потужні функції, розроблені для того, щоб зробити вашу подорож вивчення англійської структурованою, захопливою та ефективною.

# Prerequisite_Title
source: 🎯 Prerequisite Configuration
uk: 🎯 Налаштування перед початком

# Prerequisite_Description
source: Customize your learning preferences before you start:
uk: Налаштуйте свої уподобання для навчання перед початком:

# Prerequisite_Option1
source: Set the number of example sentences per word.
uk: Встановіть кількість прикладів речень на слово.

# Prerequisite_Option2
source: Choose daily vocabulary practice limits.
uk: Виберіть щоденні обмеження для практики словникового запасу.

# Prerequisite_Option3
source: Define practice session timings.
uk: Визначте час для практичних занять.

# VocabularyDeck_Title
source: 📚 Vocabulary Deck
uk: 📚 Словникові колоди

# VocabularyDeck_Description
source: Create personalized decks with topics:
uk: Створюйте персоналізовані колоди за темами:

# VocabularyDeck_Option1
source: Strict and Non-Strict deck options.
uk: Варіанти суворих та нестрогих колод.

# VocabularyDeck_Option2
source: Maximum 100 words per deck.
uk: Максимум 100 слів на колоду.

# VocabularyDeck_Option3
source: Organize your vocabulary by themes.
uk: Організуйте свій словниковий запас за темами.

# VocabularyPractice_Title
source: 🧠 Vocabulary Practice
uk: 🧠 Практика словникового запасу

# VocabularyPractice_Description
source: Tailored practice sessions:
uk: Індивідуальні практичні сесії:

# VocabularyPractice_Option1
source: Practice N words daily across K sessions.
uk: Практикуйте N слів щодня протягом K сесій.

# VocabularyPractice_Option2
source: Interactive exercises: translations, fill-in-the-gaps, context reading.
uk: Інтерактивні вправи: переклади, заповнення пропусків, читання в контексті.

# VocabularyPractice_Option3
source: Track your daily progress.
uk: Відстежуйте свій щоденний прогрес.

# Footer_Copyright
source: All Rights Reserved.
uk: Всі права захищені.

# Menu_Features
source: Features
uk: Особливості

# Menu_About
source: About
uk: Про нас

# Menu_Contact
source: Contact
uk: Контакти

# Title_LearnEnglishWithAI
source: Learn English with AI
uk: Вчіть англійську з AI

# Subtitle_ImproveYourSkills
source: Improve your English skills through interactive AI-based learning
uk: Покращуйте свої навички англійської за допомогою інтерактивного навчання на основі AI

# Button_StartLearningNow
source: Start Learning Now
uk: Розпочати навчання зараз
